
// // 1. Оголосіть змінні str, num, flag и txt зі значеннями «Привіт», 123, true, «true».
// // За допомогою typeof переконайтесь, що значення змінних належать типам: string, number и  boolean.

// let str='Привіт';
// let num=123;
// let flag=true;
// let txt='true'


// console.log(typeof(str));
// console.log(typeof(num));
// console.log(typeof(flag));
// console.log(typeof(txt));








// 2. Оголосіть змінні a1, a2, a3, a4, a5. За домогою 3х математичних оператцій отримайте числа:
//     34,
//     12,
//     66,
//     90,
//     87
//     Старайтесь використовувати різні оператори.
//     Example: 88 = (16 / 2) * 11

// let a1=(19-2)*2;
// console.log(a1);

// let a2=36/2-6*1;
// console.log(a2);

// let a3=49/7*9+3;
// console.log(a3);

// let a4=9*9+3*3;
// console.log(a4);

// let a5=9*10-15/5;
// console.log(a5);







// 3.  Створіть змінні a6, a7, a8, a9, a10. Запишіть в них результати виразів:
//     5 % 3,
//     3 % 5,
//     5 + '3',
//     '5' - 3,
//     75 + 'кг'

// let a6=5%3;
// console.log(a6);

// let a7=3%5;
// console.log(a7);

// let a8=5+'3';
// console.log(a8);

// let a9='5'-3;
// console.log(a9);

// let a10=75+'кг';
// console.log(a10);







// 4. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
//    Значееня площі зберігати в змінній s.

// let height=23;
// let width=10;
// let s=height*width
// console.log(s+'cm2')







// 5.  Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
//     результат поместите в переменную v.

// let heightC=10;
// let dC=4;
// const pi=3.1415
// let vC=pi*dC**2/4
// console.log(vC+'m3')








// 6. У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
//    Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).


// let n=3;
// let m=4;
// let k=(n**2+m**2)**(1/2)
// console.log(k)










// 8. Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби (каждой на новой строки спомощью \n).


// alert('Іващенко Юрій Валерійович\n46\nгриби,рибалка,подорожі,кіно,книги')








// 9. Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
//   Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
//   Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
//   Вывести в документ содержимое переменной concatenation спомощью document.write

// let str1='Хто '
// let str2='ти '
// let str3='такий?'
// let concatenation=str1+str2+str3

// document.write(concatenation)









// 10. Подумайте Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?


//     let str = "20";
//      let a = 5;
//      document.write(str + a + "<br/>");
//      document.write(str - a + "<br/>");
//      document.write(str * "2" + "<br/>");
//      document.write(str / 2 + "<br/>");


// <br/>-перенос рядка. все буде в стовпчик.








// 13. С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел, а вывод результата при помощи метода alert

// let a=+prompt('впишіть доданок1');
// let b=+prompt('введіть доданок2');
// alert(a+b)








// 14. С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя, фамилию и возраст, а вам не обходимо вывести строку такого вида
//       Доброго вечера Иван Иванов, мои поздравления что вам 32 , а вывод результата при помощи метода alert


// let name=prompt('Впишіть ваше ім_я');
// let surname=prompt('Впишіть ваше прізвище');
// let age=prompt('Впишіть ваш вік')
// alert('Доброго вечора, '+name+' '+surname+', мої вітання, що вам '+age)






// 1. Три різних числа вводяться через prompt().
// За допомоги if else вивести іх в порядку зростання. (відсортувати по зростанню)

// let num1=+prompt('enter num1');
// let num2=+prompt('enter num2');
// let num3=+prompt('enter num3');
// let first;
// let second;
// let third;


// if (num1>num2&&num1>num3) {first=num1}else if (num1<num2&&num1<num3) {third=num1}else{second=num1};
// if (first==num1&&num2>num3) {second=num2}else if (second==num1&&num2>num3) {first=num2}else{third=num2};
// if (first!=num1&&first!=num2) {first=num3}else if (second!=num1&&second!=num2) {second=num3}else{third=num3};

// console.log(third)
// console.log(second)
// console.log(first)



// 2.
// Все параматры получаем с клавиатуры!!!!
// Имитируем поведение пешехода на перекстке.
// Если светофор зеленый - вывести "иди".
// Если светофор желтый - вывести "подожди".
// Если светофор красный - вывести "стой".
// Если светофор в аварийном режиме вывести "делай что хочешь"!

// 3
// Все параметры получаем с клавиатуры!!!!(prompt , confirm)
// Создать переменную isRoadClear которая характеризирует наличие на дороге машин.
// Улучшаем предыдущее задание.
// Если светофор зеленый и машин нет - вывести "иди".
// Если светофор зеленый и машины есть  - вывести подожди пока нарушители проедут".
// Если светофор желтый и машины есть - вывести "жди".
// Если светофор желтый и машин нет - вывести "все рано жди".
// Если светофор красный и машин нет- вывести "стой все рано".
// Если светофор красный - и машины есть вывести "стой и жди".
// Если светофор в аварийном режиме вывести "делай что хочешь"!


